---
title: BaseArray
classe: Autodesk.Revit.DB.BaseArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# BaseArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FamilyParameter Label { get; set; }` | `baseArray.Label` | FamilyParameter |
| `String Name { get; set; }` | `baseArray.Name` | String |
| `Int32 NumMembers { get; set; }` | `baseArray.NumMembers` | Int32 |
| `ICollection<ElementId> GetCopiedMemberIds()` | `baseArray.GetCopiedMemberIds()` | ICollection<ElementId> |
| `ICollection<ElementId> GetOriginalMemberIds()` | `baseArray.GetOriginalMemberIds()` | ICollection<ElementId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```